protected/common/modules/cms/views/front/page.php


$this->params['inner'] = true;

$offices = \common\models\Office::find()->all();
$phones = \common\models\Office::find()->select('phone')->distinct()->all();
$addresses = \common\models\Office::find()->select('address')->distinct()->all();
$emails = \common\models\Office::find()->select('email')->distinct()->all();
---
SELECT * FROM `office`
SELECT DISTINCT `phone` FROM `office`
SELECT DISTINCT `address` FROM `office`
SELECT DISTINCT `email` FROM `office`