protected/frontend/modules/site/controllers/DefaultController.php

SELECT * FROM `slide` WHERE `active`=1 ORDER BY `order`
SELECT * FROM `testimonials` WHERE `active`=1 ORDER BY `order`
---
    public function actionIndex()
    {
        $manager     = new HomeManager();
        $homePageDTO = new HomePageDTO();
        $manager->setPageData($homePageDTO);

        $slides = Slide::find()->where(['active'=>1])->orderBy('order ASC')->all();
	      $testimonials = Testimonials::find()->where(['active'=>1])->orderBy('order ASC')->all();