protected/frontend/widgets/FilterFrontWidget.php

SELECT DISTINCT `attribute_value` FROM `tbl_product_attribute_mapping` WHERE `attribute_id`='3'
SELECT DISTINCT `attribute_value` FROM `tbl_product_attribute_mapping` WHERE `attribute_id`='4'
---
	public function run(){

		$attributes = array_map(function($attr){

			$values = ProductAttributeMapping::find()->where(['attribute_id'=>$attr['id']])->select(['attribute_value'])->distinct()->asArray()->all();

			$out = [
				'id'=>$attr['id'],
				'name'=>$attr['name'],
				'values'=>ArrayHelper::getColumn($values, 'attribute_value')
			];

			sort($out['values']);

			return $out;
		}, array_filter(ProductAttributeDAO::getAll('en-US'), function($attr){

			return in_array($attr['name'], ['Ширина', "Профіль", "Діаметр", "Сезон"]);
		}));

		$disk_attributes = array_map(function($attr){

			$values = ProductAttributeMapping::find()->where(['attribute_id'=>$attr['id']])->select(['attribute_value'])->distinct()->asArray()->all();